{
    "disorder": "Post-Traumatic Stress Disorder",
    "code": "F43.10",
    "criteria": [
        "A. Exposure to actual or threatened death, serious injury, or sexual violence in one or more ways:",
        "  1. Directly experiencing the traumatic event",
        "  2. Witnessing the event in person as it happened to others",
        "  3. Learning of trauma occurring to close family member or friend",
        "  4. Repeated or extreme indirect exposure to aversive details (e.g., first responders)",
        "",
        "B. Presence of one or more intrusion symptoms associated with the trauma:",
        "  1. Recurrent involuntary, distressing intrusive memories",
        "  2. Recurrent distressing trauma-related dreams",
        "  3. Dissociative reactions (e.g., flashbacks)",
        "  4. Intense/prolonged psychological distress at trauma-related cues",
        "  5. Marked physiological reactions to trauma cues",
        "",
        "C. Persistent avoidance of trauma-related stimuli (one or both):",
        "  1. Avoidance of distressing memories, thoughts, or feelings",
        "  2. Avoidance of external reminders (people, places, objects, situations)",
        "",
        "D. Negative alterations in cognition and mood (two or more):",
        "  1. Inability to remember important aspects of trauma",
        "  2. Persistent exaggerated negative beliefs about self, others, or world",
        "  3. Persistent distorted blame of self or others for trauma",
        "  4. Persistent negative emotional states (fear, horror, anger, guilt, shame)",
        "  5. Markedly diminished interest or participation in activities",
        "  6. Feelings of detachment or estrangement from others",
        "  7. Persistent inability to experience positive emotions",
        "",
        "E. Marked alterations in arousal and reactivity (two or more):",
        "  1. Irritable behaviour and angry outbursts",
        "  2. Reckless or self-destructive behaviour",
        "  3. Hypervigilance",
        "  4. Exaggerated startle response",
        "  5. Problems with concentration",
        "  6. Sleep disturbance",
        "",
        "F. Duration of disturbance (B, C, D, E) more than 1 month",
        "",
        "G. Clinically significant distress or functional impairment",
        "",
        "H. Not attributable to substance or another medical condition"
    ],
    "specifiers": [
        "With dissociative symptoms (depersonalization or derealization)",
        "With delayed expression (full criteria not met until ≥6 months post-trauma)",
        "Acute stress disorder: same criteria but duration 3 days to 1 month"
    ]
}
